nxp-mcuxpresso/mcux-devices-wireless/KW/KW43B43ZC6/iar/startup_KW43B43ZC6.s
        PUBWEAK Reserved70_IRQHandler
        PUBWEAK RF_ZIGBEE_IRQHandler
        PUBWEAK RF_Generic_IRQHandler
        PUBWEAK RF_BRIC_IRQHandler
        PUBWEAK RF_LCL_IRQHandler
        PUBWEAK RF_WOR_IRQHandler
        PUBWEAK RFMC_IRQHandler
        PUBWEAK Reserved77_IRQHandler
        PUBWEAK Reserved78_IRQHandler
        PUBWEAK COEX_INT_IRQHandler
        PUBWEAK Reserved80_IRQHandler
        PUBWEAK GPIOA_INT0_IRQHandler
        PUBWEAK GPIOA_INT1_IRQHandler
        PUBWEAK GPIOB_INT0_IRQHandler
        PUBWEAK GPIOB_INT1_IRQHandler
        PUBWEAK GPIOC_INT0_IRQHandler
        PUBWEAK GPIOC_INT1_IRQHandler
        PUBWEAK GPIOD_INT0_IRQHandler
        PUBWEAK GPIOD_INT1_IRQHandler
        PUBWEAK Reserved89_IRQHandler
        PUBWEAK Reserved90_IRQHandler
        PUBWEAK Reserved91_IRQHandler
        PUBWEAK Reserved92_IRQHandler
        PUBWEAK ADC0_IRQHandler
        PUBWEAK CMP0_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE0_CMP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE0_CAP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE0_RELOAD_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE1_CMP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE1_CAP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE1_RELOAD_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE2_CMP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE2_CAP_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE2_RELOAD_IRQHandler
        PUBWEAK FLEXPWM0_RELOAD_ERROR_IRQHandler
        PUBWEAK FLEXPWM0_FAULT_IRQHandler
        PUBWEAK ITRC_IRQHandler
        PUBWEAK TDET_IRQHandler
        PUBWEAK MU0_IRQHandler
        PUBWEAK INTM_IRQHandler
        PUBWEAK SGI_IRQHandler
        PUBWEAK SECURE_ERR_IRQHandler
        PUBWEAK PKC_IRQHandler
        PUBWEAK TRNG0_IRQHandler
        PUBWEAK FLASH_Arbiter_IRQHandler
        PUBWEAK BLE_INT0_IRQHandler
        PUBWEAK BLE_INT1_IRQHandler
        PUBWEAK BLE_INT2_IRQHandler
        PUBWEAK BRF_INT_IRQHandler
        PUBWEAK T1_INT_IRQHandler
        PUBWEAK T2_INT_IRQHandler
        PUBWEAK T3_INT_IRQHandler
        PUBWEAK T4_INT_IRQHandler
        PUBWEAK WDG1_IRQHandler
        PUBWEAK OSC_32M_READY_IRQHandler
        PUBWEAK RBME_INT_IRQHandler
        PUBWEAK RSM_INT_IRQHandler
        PUBWEAK PLL_ABORT_INT_IRQHandler
        PUBWEAK DMA_LIGHT_IRQHandler
        PUBWEAK DMA_LIGHT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_LIGHT_IRQHandler
        LDR     R0, =DMA_LIGHT_DriverIRQHandler
        BX      R0

        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)
CTI_IRQHandler
CMC0_IRQHandler
DMA0_DriverIRQHandler
EWM0_IRQHandler
MCM0_IRQHandler
MSCM0_IRQHandler
SYSCON0_IRQHandler
SECCON0_IRQHandler
SPC0_IRQHandler
WUU0_IRQHandler
WDOG0_IRQHandler
WDOG1_IRQHandler
CDOG0_IRQHandler
CDOG1_IRQHandler
SCG0_IRQHandler
SFA0_DriverIRQHandler
FMU0_IRQHandler
SFA1_DriverIRQHandler
DSB0_IRQHandler
TRDC0_IRQHandler
RTC_Alarm_IRQHandler
RTC_Seconds_IRQHandler
LPTMR0_IRQHandler
LPTMR1_IRQHandler
LPIT0_IRQHandler
TPM_0_IRQHandler
TPM_1_IRQHandler
TPM_2_IRQHandler
TPM_3_IRQHandler
TPM_4_IRQHandler
MU1_IRQHandler
SYSCON0_ECC_IRQHandler
LPI2C0_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
Reserved70_IRQHandler
RF_ZIGBEE_IRQHandler
RF_Generic_IRQHandler
RF_BRIC_IRQHandler
RF_LCL_IRQHandler
RF_WOR_IRQHandler
RFMC_IRQHandler
Reserved77_IRQHandler
Reserved78_IRQHandler
COEX_INT_IRQHandler
Reserved80_IRQHandler
GPIOA_INT0_IRQHandler
GPIOA_INT1_IRQHandler
GPIOB_INT0_IRQHandler
GPIOB_INT1_IRQHandler
GPIOC_INT0_IRQHandler
GPIOC_INT1_IRQHandler
GPIOD_INT0_IRQHandler
GPIOD_INT1_IRQHandler
Reserved89_IRQHandler
Reserved90_IRQHandler
Reserved91_IRQHandler
Reserved92_IRQHandler
ADC0_IRQHandler
CMP0_IRQHandler
FLEXPWM0_SUBMODULE0_CMP_IRQHandler
FLEXPWM0_SUBMODULE0_CAP_IRQHandler
FLEXPWM0_SUBMODULE0_RELOAD_IRQHandler
FLEXPWM0_SUBMODULE1_CMP_IRQHandler
FLEXPWM0_SUBMODULE1_CAP_IRQHandler
FLEXPWM0_SUBMODULE1_RELOAD_IRQHandler
FLEXPWM0_SUBMODULE2_CMP_IRQHandler
FLEXPWM0_SUBMODULE2_CAP_IRQHandler
FLEXPWM0_SUBMODULE2_RELOAD_IRQHandler
FLEXPWM0_RELOAD_ERROR_IRQHandler
FLEXPWM0_FAULT_IRQHandler
ITRC_IRQHandler
TDET_IRQHandler
MU0_IRQHandler
INTM_IRQHandler
SGI_IRQHandler
SECURE_ERR_IRQHandler
PKC_IRQHandler
TRNG0_IRQHandler
FLASH_Arbiter_IRQHandler
BLE_INT0_IRQHandler
BLE_INT1_IRQHandler
BLE_INT2_IRQHandler
BRF_INT_IRQHandler
T1_INT_IRQHandler
T2_INT_IRQHandler
T3_INT_IRQHandler
T4_INT_IRQHandler
WDG1_IRQHandler
OSC_32M_READY_IRQHandler
RBME_INT_IRQHandler
RSM_INT_IRQHandler
PLL_ABORT_INT_IRQHandler
DMA_LIGHT_DriverIRQHandler
DefaultISR
        B DefaultISR

        END
